tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeater/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      5;

writeFormat     ascii;

writePrecision  7;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    topAir_minX
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        enabled         true;
        outputControl   outputTime;

        region          topAir;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     false;  //true;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      minX;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       areaIntegrate;

        fields
        (
            p
            phi         // surface fields not supported for sampledSurface
            U
        );
    }

    topAir_maxX
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        enabled         true;
        outputControl   outputTime;

        region          topAir;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     false;  //true;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      maxX;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       areaIntegrate;

        fields
        (
            p
            phi         // surface fields not supported for sampledSurface
            U
        );
    }

}

// ************************************************************************* //
